/* %@ (localhost): disconnected */
"%@ (localhost): disconnected" = "%@ (paikallinen): yhteys katkaistu";

/* %@ exists. Overwrite? */
"%@ exists. Overwrite?" = "%@ on jo olemassa. Korvataanko?";

/* A new version of Fugu is now available. */
"A new version of Fugu is now available." = "Fugusta on saatavilla uusi versio.";

/* An error occurred checking for updates. */
"An error occurred checking for updates." = "Päivitysten tarkastamisessa tapahtui virhe.";

/* Are you sure you want to cancel this copy? */
"Are you sure you want to cancel this copy?" = "Oletko varma että haluat keskeyttää kopioinnin?";

/* Authenticating... */
"Authenticating..." = "Autentikoin...";

/* Authenticating.... */
"Authenticating...." = "Autentikoin....";

/* Cancel */
"Cancel" = "Kumoa";

/* cannot yet download directories. */
"cannot yet download directories." = "Hakemistoja ei voida vielä ladata.";

/* Clear */
"Clear" = "Tyhjennä";

/* Clear Defaults? */
"Clear Defaults?" = "Tyhjennä oletusasetukset?";

/* Connecting to %@... */
"Connecting to %@..." = "Otan yhteyttä: %@...";

/* Connecting.... */
"Connecting...." = "Yhdistän....";

/* Couldn't create %@: %s */
"Couldn't create %@: %s" = "Kohdetta %@ kohteessa %s ei voitu luoda";

/* Couldn't create preview of %@ */
"Couldn't create preview of %@" = "Esikatselua ei voitu luoda kohteelle %@";

/* Couldn't delete %@. */
"Couldn't delete %@." = "Kohdetta %@ ei voitu poistaa.";

/* Couldn't find %@ to launch %@. */
"Couldn't find %@ to launch %@." = "Kohdetta %@ ei löytynyt. Kohdetta %@ ei voida aukaista.";

/* Couldn't load nib file from the application bundle! */
"Couldn't load nib file from the application bundle!" = "Nib-tiedostoa ei voitu ladata ohjelmapakkauksesta!";

/* Couldn't view %@: %s */
"Couldn't view %@: %s" = "Kohdetta %@ kohteesta %s ei voitu näyttää";

/* Date */
"Date" = "Muutosaika";

/* Delete */
"Delete" = "Poista";

/* Delete %@? */
"Delete %@?" = "Poista %@?";

/* Disconnect */
"Disconnect" = "Katkaise yhteys";

/* Do you want to move %@ to the Trash? */
"Do you want to move %@ to the Trash?" = "Haluatko siirtää kohteen %@ roskakoriin?";

/* Don't Cancel */
"Don't Cancel" = "Älä kumoa";

/* Download */
"Download" = "Hae levylle";

/* Downloading %s... */
"Downloading %s..." = "Haen kohdetta %s levylle...";

/* Edit with Text Editor */
"Edit with Text Editor" = "Avaa tekstinkäsittelyohjelmassa";

/* Error */
"Error" = "Virhe";

/* Exit */
"Exit" = "Poistu";

/* Focus on Remote Pane */
"Focus on Remote Pane" = "Tarkenna palvelimen kohteisiin";

/* Group */
"Group" = "Ryhmä";

/* Hide Special Files */
"Hide Special Files" = "Kätke erikoistiedostot";

/* Image size: %.0f x %.0f */
"Image size: %.0f x %.0f" = "Kuvan koko: %.0f x %.0f";

/* Invalid port number. */
"Invalid port number." = "Portin numero on virheellinen.";

/* localhost: disconnected */
"localhost: disconnected" = "paikallinen: yhteys katkaistu";

/* Locally */
"Locally" = "Paikallisesti";

/* OK */
"OK" = "OK";

/* Open Keychain Access */
"Open Keychain Access" = "Avaa Avainnipun käyttö";

/* Overwrite */
"Overwrite" = "Korvaa";

/* Owner */
"Owner" = "Omistaja";

/* Parameter length exceeds bounds. Try again. */
"Parameter length exceeds bounds. Try again." = "Parametri on liian pitkä. Yritä uudelleen.";

/* Password is too long. */
"Password is too long." = "Salasana on liian pitkä.";

/* Permission denied. Try again. */
"Permission denied. Try again." = "Oikeutesi eivät riitä. Yritä uudelleen.";

/* Permissions */
"Permissions" = "Oikeudet";

/* problem persists, please contact the authors of Fugu. */
"problem persists, please contact the authors of Fugu." = "ongelma esiintyy toistuvasti, ota yhteyttä Fugun tekijöihin.";

/* Quit */
"Quit" = "Lopeta";

/* rename %@ to %@: %s */
"rename %@ to %@: %s" = "nimeä %@ -> %@: %s";

/* Requesting file listing from server.... */
"Requesting file listing from server...." = "Pyydän tiedostolistausta palvelimelta....";

/* Show Hidden Files */
"Show Hidden Files" = "Näytä piilotetut tiedostot";

/* Size */
"Size" = "Koko";

/* the one you have. Would you like to get it? */
"the one you have. Would you like to get it?" = "kuin mikä sinulla on. Haluatko hakea sen?";

/* the selected items */
"the selected items" = "valitut kohteet";

/* Upload */
"Upload" = "Lataa palvelimelle";

/* Warning: OpenSSH's sftp client cannot yet download directories. */
"Warning: OpenSSH's sftp client cannot yet download directories." = "Varoitus: OpenSSH'n sftp client ei voi vielä ladata hakemistoja.";

/* Warning: Some remote documents are still being edited. */
"Warning: Some remote documents are still being edited." = "Varoitus: Joitakin palvelimen tiedostoja editoidaan vielä.";

/* Warning: Upload queue not empty. */
"Warning: Upload queue not empty." = "Varoitus: Latausjono ei ole tyhjä.";

/* Would you like to download %@ to %@ with SCP instead? */
"Would you like to download %@ to %@ with SCP instead?" = "Haluatko ladata kohteen %@ kohteeseen %@ käyttäen SCP:tä?";

/* Write failed: Did not write correct number of bytes! */
"Write failed: Did not write correct number of bytes!" = "Kirjoitus epäonnistui: Tavuja ei kirjoitettu oikeaa määrää!";

/* Wrote %d bytes to file descriptor */
"Wrote %d bytes to file descriptor" = "%d tavua kirjoitettu tiedoston määrittelijään";

/* You cannot undo this action. */
"You cannot undo this action." = "Tätä toimintoa ei voida perua.";

/* You have the most recent version of Fugu. */
"You have the most recent version of Fugu." = "Sinulla on jo Fugun uusin versio.";

/* you like to open Keychain Access to edit it? */
"you like to open Keychain Access to edit it?" = "haluatko avata Avainnipun käytön muokataksesi sitä?";

/* You must provide a username and server address to continue. */
"You must provide a username and server address to continue." = "Sinun on annettava käyttäjätunnus ja palvelimen osoite jatkaaksesi.";

/* you want to disconnect without uploading all of them? */
"you want to disconnect without uploading all of them?" = "haluatko katkaista yhteyden lataamatta kaikkia kohteita palvelimelle?";

/* you will lose any unsaved changes. Are you sure you want to disconnect? */
"you will lose any unsaved changes. Are you sure you want to disconnect?" = "tallentamattomat muutokset menetetään. Oletko varma että haluat katkaista yhteyden?";

/* You will not be able to undo this action. */
"You will not be able to undo this action." = "Tätä toimintoa ei voida perua.";

